БухЭксп/InformationRegisters/CW_ОбменГИСЭПДСвязанныеДокументыЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбменГИСЭПДСвязанныеДокументыЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйЭПД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроформаТитулаЭПД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбменГИСЭПДПроформыТитуловЭПД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбменГИСЭПДНастройкиЗаполненияЭПД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокументаЭПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбменГИСЭПДПроформыТитуловЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбменГИСЭПДПроформыТитуловЭПД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокументаЭПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулГрузоотправителяГрузополучатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулГрузоотправителяГрузоотправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулГрузоотправителяПеревозчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтактнойИнформации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияРеквизитовДокументовЭПД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеМакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбменГИСЭПД_ОснованияЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_ОбменГИСЭПДСозданиеЭПД/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеревоЗначений 	= РеквизитФормыВЗначение("ДеревоТитулов");  
	
	ТипОбъекта 		= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Параметры.ПараметрКоманды));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ТипДокументаЭПД КАК ТипДокументаЭПД,
	               |	CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ТекущийТитул КАК ТекущийТитул
	               |ПОМЕСТИТЬ ВТ_НастроенныеТитулы
	               |ИЗ
	               |	Справочник.CW_ОбменГИСЭПДНастройкиЗаполненияЭПД КАК CW_ОбменГИСЭПДНастройкиЗаполненияЭПД
	               |ГДЕ
	               |	CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ТипОбъекта = &ТипОбъекта
	               |	И CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.Основная = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ОбменГИСЭПДПроформыТитуловЭПД.ТекущийТитул КАК ТекущийТитул,
	               |	CW_ОбменГИСЭПДПроформыТитуловЭПД.ТипДокументаЭПД КАК ТипДокументаЭПД,
	               |	CW_ОбменГИСЭПДПроформыТитуловЭПД.Ссылка КАК ПроформаЭПД,
	               |	CW_ОбменГИСЭПДСвязанныеДокументыЭПД.СвязанныйЭПД КАК СвязанныйЭПД
	               |ПОМЕСТИТЬ ВТ_СуществующиеДокументы
	               |ИЗ
	               |	Справочник.CW_ОбменГИСЭПДПроформыТитуловЭПД КАК CW_ОбменГИСЭПДПроформыТитуловЭПД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД КАК CW_ОбменГИСЭПДСвязанныеДокументыЭПД
	               |		ПО CW_ОбменГИСЭПДПроформыТитуловЭПД.Ссылка = CW_ОбменГИСЭПДСвязанныеДокументыЭПД.ПроформаТитулаЭПД
	               |ГДЕ
	               |	CW_ОбменГИСЭПДПроформыТитуловЭПД.ОбъектОснование = &ОбъектОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НастроенныеТитулы.ТипДокументаЭПД КАК ТипДокументаЭПД,
	               |	ВТ_НастроенныеТитулы.ТекущийТитул КАК ТекущийТитул,
	               |	ЕСТЬNULL(ВТ_СуществующиеДокументы.ПроформаЭПД, НЕОПРЕДЕЛЕНО) КАК ПроформаЭПД,
	               |	ЕСТЬNULL(ВТ_СуществующиеДокументы.ПроформаЭПД, ВТ_СуществующиеДокументы.СвязанныйЭПД) КАК ЭПД
	               |ИЗ
	               |	ВТ_НастроенныеТитулы КАК ВТ_НастроенныеТитулы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуществующиеДокументы КАК ВТ_СуществующиеДокументы
	               |		ПО ВТ_НастроенныеТитулы.ТипДокументаЭПД = ВТ_СуществующиеДокументы.ТипДокументаЭПД
	               |			И ВТ_НастроенныеТитулы.ТекущийТитул = ВТ_СуществующиеДокументы.ТекущийТитул
	               |ИТОГИ ПО
	               |	ТипДокументаЭПД"; 
	
	Запрос.УстановитьПараметр("ТипОбъекта", 		ТипОбъекта);
	Запрос.УстановитьПараметр("ОбъектОснование",	Параметры.ПараметрКоманды);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	
	ВыборкаТипДокумента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТипДокумента.Следующий() ЦИкл  
		
		СтрокаТипа = ДеревоЗначений.Строки.Добавить();
		СтрокаТипа.ТипДокументаТитул = ВыборкаТипДокумента.ТипДокументаЭПД;
		СтрокаТипа.ЭтоГруппа 		= истина;
		
		ВыборкаТитул = ВыборкаТипДокумента.Выбрать();
		Пока ВыборкаТитул.Следующий() ЦИкл
			СтрокаТитула = СтрокаТипа.Строки.Добавить();
			СтрокаТитула.ТипДокументаТитул 	= ВыборкаТитул.ТекущийТитул;
			СтрокаТитула.ПроформаЭПД 		= ВыборкаТитул.ПроформаЭПД;
			СтрокаТитула.ЭПД 				= ВыборкаТитул.ЭПД; 
			СтрокаТитула.ЕстьЭПД            = ЗначениеЗаполнено(ВыборкаТитул.ЭПД)
		КонецЦикла;  
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоТитулов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ЭлементыДерева =ДеревоТитулов.ПолучитьЭлементы(); 
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл
		Элементы.ДеревоТитулов.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСозданиеЭПД(Команда)
	
	ВыбраннаяСтрока = Элементы.ДеревоТитулов.ТекущаяСтрока;
	
	НачатьФормированиеЭПД(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТитуловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	НачатьФормированиеЭПД(ВыбраннаяСтрока);

КонецПроцедуры  

&НаКлиенте
Процедура НачатьФормированиеЭПД(Знач ВыбраннаяСтрока)
	
	ДанныеСтроки = ПолучитьДанныеСтроки(ВыбраннаяСтрока);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьФормированиеЭПД", ЭтотОбъект, ДанныеСтроки);
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ДокументЭПД) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Проформа ЭПД для выбранного титула существует! Обновить?", Режим, 0); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ПродолжитьФормированиеЭПД(КодВозврата, ДополнительныеПараметры) Экспорт
    Если КодВозврата = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

 	Закрыть(ДополнительныеПараметры);

КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеСтроки(ВыбраннаяСтрока)
	
	СтрокаДерева = ДеревоТитулов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаДерева.ЭтоГруппа Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтрокаРодитель = СтрокаДерева.ПолучитьРодителя();
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("ТипДокументаЭПД",	СтрокаРодитель.ТипДокументаТитул);
	ДанныеСтроки.Вставить("ТекущийТитул",		СтрокаДерева.ТипДокументаТитул);
	ДанныеСтроки.Вставить("ДокументЭПД",		СтрокаДерева.ПроформаЭПД);
	
	Возврат ДанныеСтроки;
	
КонецФункции
